;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Sat Oct 27 23:57:19 2012                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far_aggregates --silicon_version=6700 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C670x                                          *
;*   Optimization      : Disabled                                             *
;*   Optimizing for    : Compile time, Ease of Development                    *
;*                       Based on options: no -o, no -ms                      *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far Aggregate Data                                   *
;*   Pipelining        : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *
;*   Debug Info        : Optimized w/Profiling Info                           *

           ADD     .L2     B7,B8,B7          ; |160| 
||         STW     .D2T2   B6,*+SP(24)       ; |160| 

           ADD     .L2     B7,B9,B6          ; |160| 
	.dwpsn	"main.c",161,0
           STW     .D2T2   B6,*+SP(28)       ; |160| 
           ; BRANCHCC OCCURS {L5}            ; |159| 
DW$L$_convolve_opt$2$E:
;** --------------------------------------------------------------------------*
L6:    
           RET     .S2     B3                ; |164| 
           LDDW    .D2T1   *+SP(24),A5:A4    ; |163| 
           ADDK    .S2     32,SP             ; |164| 
	.dwpsn	"main.c",164,1
           NOP             3
           ; BRANCH OCCURS {B3}              ; |164| 

DW$42	.dwtag  DW_TAG_loop
	.dwattr DW$42, DW_AT_name("H:\SPH\firmware\lab3\main.asm:L5:1:1351396639")
	.dwattr DW$42, DW_AT_begin_file("main.c")
	.dwattr DW$42, DW_AT_begin_line(0x9f)
	.dwattr DW$42, DW_AT_end_line(0xa1)
DW$43	.dwtag  DW_TAG_loop_range
	.dwattr DW$43, DW_AT_low_pc(DW$L$_convolve_opt$2$B)
	.dwattr DW$43, DW_AT_high_pc(DW$L$_convolve_opt$2$E)
	.dwendtag DW$42

	.dwattr DW$38, DW_AT_end_file("main.c")
	.dwattr DW$38, DW_AT_end_line(0xa4)
	.dwattr DW$38, DW_AT_end_column(0x01)
	.dwendtag DW$38

;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".const"
SL1:	.string	"convovle cycles: %d",10,0
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_DSK6713_AIC23_write
	.global	_DSK6713_AIC23_read
	.global	_printf
	.global	_clock
	.global	_exit
	.global	__strasg
	.global	__divd

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

DW$T$24	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)
DW$44	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
	.dwendtag DW$T$24


DW$T$25	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
DW$T$27	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$27, DW_AT_type(*DW$T$26)
DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("Int16"), DW_AT_type(*DW$T$8)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)

DW$T$30	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
	.dwattr DW$T$30, DW_AT_language(DW_LANG_C)
DW$45	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$46	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
	.dwendtag DW$T$30


DW$T$33	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
	.dwattr DW$T$33, DW_AT_language(DW_LANG_C)
DW$47	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$48	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$33

DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x04)
DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("DSK6713_AIC23_CodecHandle"), DW_AT_type(*DW$T$10)
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)

DW$T$38	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$38, DW_AT_language(DW_LANG_C)
DW$49	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$50	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$T$38


DW$T$40	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$40, DW_AT_language(DW_LANG_C)
DW$T$42	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$42, DW_AT_address_class(0x20)
DW$T$43	.dwtag  DW_TAG_restrict_type
	.dwattr DW$T$43, DW_AT_type(*DW$T$42)

DW$T$46	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$45)
	.dwattr DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$46, DW_AT_byte_size(0x28)
DW$51	.dwtag  DW_TAG_subrange_type
	.dwattr DW$51, DW_AT_upper_bound(0x09)
	.dwendtag DW$T$46

DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)
DW$T$32	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
	.dwattr DW$T$32, DW_AT_address_class(0x20)
DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("clock_t"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)

DW$T$48	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$47)
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
DW$T$14	.dwtag  DW_TAG_base_type, DW_AT_name("long long")
	.dwattr DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$14, DW_AT_byte_size(0x08)

DW$T$50	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$14)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
DW$52	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
DW$53	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
DW$54	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$50

DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("DSK6713_AIC23_Config"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)
DW$T$56	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$55)
	.dwattr DW$T$56, DW_AT_address_class(0x20)
DW$T$37	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
	.dwattr DW$T$37, DW_AT_address_class(0x20)
DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("Uint8"), DW_AT_type(*DW$T$6)
	.dwattr DW$T$26, DW_AT_language(DW_LANG_C)
DW$T$8	.dwtag  DW_TAG_base_type, DW_AT_name("short")
	.dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$8, DW_AT_byte_size(0x02)
DW$T$45	.dwtag  DW_TAG_const_type
	.dwattr DW$T$45, DW_AT_type(*DW$T$10)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)

DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_name("DSK6713_AIC23_Config")
	.dwattr DW$T$20, DW_AT_byte_size(0x28)
DW$55	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$55, DW_AT_name("regs"), DW_AT_symbol_name("_regs")
	.dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20

DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("FILE"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
DW$T$36	.dwtag  DW_TAG_const_type
	.dwattr DW$T$36, DW_AT_type(*DW$T$35)
DW$T$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DW$T$6, DW_AT_byte_size(0x01)

DW$T$19	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$19, DW_AT_byte_size(0x28)
DW$56	.dwtag  DW_TAG_subrange_type
	.dwattr DW$56, DW_AT_upper_bound(0x09)
	.dwendtag DW$T$19


DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_byte_size(0x1c)
DW$57	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$57, DW_AT_name("fd"), DW_AT_symbol_name("_fd")
	.dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
DW$58	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$58, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
	.dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
DW$59	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$59, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
DW$60	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$60, DW_AT_name("bufend"), DW_AT_symbol_name("_bufend")
	.dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
DW$61	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$61, DW_AT_name("buff_stop"), DW_AT_symbol_name("_buff_stop")
	.dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
DW$62	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$62, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
	.dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
DW$63	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$63, DW_AT_name("index"), DW_AT_symbol_name("_index")
	.dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22

DW$T$35	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$35, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$35, DW_AT_byte_size(0x01)
DW$T$21	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$21, DW_AT_address_class(0x20)

	.dwattr DW$32, DW_AT_external(0x01)
	.dwattr DW$32, DW_AT_type(*DW$T$14)
	.dwattr DW$38, DW_AT_external(0x01)
	.dwattr DW$38, DW_AT_type(*DW$T$14)
	.dwattr DW$27, DW_AT_external(0x01)
	.dwattr DW$27, DW_AT_type(*DW$T$10)
	.dwattr DW$28, DW_AT_external(0x01)
	.dwattr DW$30, DW_AT_external(0x01)
	.dwattr DW$31, DW_AT_external(0x01)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$64	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$64, DW_AT_location[DW_OP_reg0]
DW$65	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$65, DW_AT_location[DW_OP_reg1]
DW$66	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$66, DW_AT_location[DW_OP_reg2]
DW$67	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$67, DW_AT_location[DW_OP_reg3]
DW$68	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$68, DW_AT_location[DW_OP_reg4]
DW$69	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$69, DW_AT_location[DW_OP_reg5]
DW$70	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$70, DW_AT_location[DW_OP_reg6]
DW$71	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$71, DW_AT_location[DW_OP_reg7]
DW$72	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$72, DW_AT_location[DW_OP_reg8]
DW$73	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$73, DW_AT_location[DW_OP_reg9]
DW$74	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$74, DW_AT_location[DW_OP_reg10]
DW$75	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$75, DW_AT_location[DW_OP_reg11]
DW$76	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$76, DW_AT_location[DW_OP_reg12]
DW$77	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$77, DW_AT_location[DW_OP_reg13]
DW$78	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$78, DW_AT_location[DW_OP_reg14]
DW$79	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$79, DW_AT_location[DW_OP_reg15]
DW$80	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$80, DW_AT_location[DW_OP_reg16]
DW$81	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$81, DW_AT_location[DW_OP_reg17]
DW$82	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$82, DW_AT_location[DW_OP_reg18]
DW$83	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$83, DW_AT_location[DW_OP_reg19]
DW$84	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$84, DW_AT_location[DW_OP_reg20]
DW$85	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$85, DW_AT_location[DW_OP_reg21]
DW$86	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$86, DW_AT_location[DW_OP_reg22]
DW$87	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$87, DW_AT_location[DW_OP_reg23]
DW$88	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$88, DW_AT_location[DW_OP_reg24]
DW$89	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$89, DW_AT_location[DW_OP_reg25]
DW$90	.dwtag  DW_TAG_assign_register, DW_AT_name("B10")
	.dwattr DW$90, DW_AT_location[DW_OP_reg26]
DW$91	.dwtag  DW_TAG_assign_register, DW_AT_name("B11")
	.dwattr DW$91, DW_AT_location[DW_OP_reg27]
DW$92	.dwtag  DW_TAG_assign_register, DW_AT_name("B12")
	.dwattr DW$92, DW_AT_location[DW_OP_reg28]
DW$93	.dwtag  DW_TAG_assign_register, DW_AT_name("B13")
	.dwattr DW$93, DW_AT_location[DW_OP_reg29]
DW$94	.dwtag  DW_TAG_assign_register, DW_AT_name("DP")
